; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-39)
 (:domain miconic)
 (:objects 
    p1 p2 p3 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 - floor
    )
 (:init 
    (lift-at f2)
    (origin p1 f5)
    (destin p1 f4)
    (origin p2 f4)
    (destin p2 f8)
    (origin p3 f8)
    (destin p3 f3)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f6 f7)
    (above f6 f8)
    (above f7 f8)
)
 (:goal (and 
(served p1)
(served p2)
))
)

; plan
1. (up f2 f5)
   deleted: (lift-at f2)
   added: (lift-at f5)
   goals met: 0 of 2
2. (board f5 p1)
   added: (boarded p1)
   goals met: 0 of 2
3. (down f5 f4)
   deleted: (lift-at f5)
   added: (lift-at f4)
   goals met: 0 of 2
4. (board f4 p2)
   added: (boarded p2)
   goals met: 0 of 2
5. (depart f4 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 1 of 2
6. (up f4 f8)
   deleted: (lift-at f4)
   added: (lift-at f8)
   goals met: 1 of 2
7. (depart f8 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 2 of 2
